In [14]:
import pandas as pd

In [15]:
retails = pd.read_csv("M:\Python\Pandas\DataSets\sample2.csv")

In [16]:
retails.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944  01-01-2016          1  AUTOMOTIVE   6750         1320
1  1945945  02-01-2016          1   BABY CARE   1450            0
2  1945946  15-01-2016          1      BEAUTY   1978         6952
3  1945947  01-01-2016          1   BEVERAGES      0            0
4  1945948  23-01-2016          1       BOOKS      0            0

In [17]:
retails.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 449 entries, 0 to 448
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           449 non-null    int64
 1   date         449 non-null    object
 2   store_nbr    449 non-null    int64
 3   family       449 non-null    object
 4   sales        449 non-null    int64
 5   onpromotion  449 non-null    int64
dtypes: int64(4), object(2)
memory usage: 73.2 KB

In [18]:
#convert date data time object to datetime

retails = retails.astype({'date': 'datetime64'})

In [19]:
retails.head()

        id       date  store_nbr      family  sales  onpromotion
0  1945944 2016-01-01          1  AUTOMOTIVE   6750         1320
1  1945945 2016-02-01          1   BABY CARE   1450            0
2  1945946 2016-01-15          1      BEAUTY   1978         6952
3  1945947 2016-01-01          1   BEVERAGES      0            0
4  1945948 2016-01-23          1       BOOKS      0            0

In [20]:
retails.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 449 entries, 0 to 448
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           449 non-null    int64
 1   date         449 non-null    datetime64[ns]
 2   store_nbr    449 non-null    int64
 3   family       449 non-null    object
 4   sales        449 non-null    int64
 5   onpromotion  449 non-null    int64
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 47.4 KB

In [21]:
retails.loc[0, ['date']] = 'N/A'
retails.head()

        id                 date  store_nbr      family  sales  onpromotion
0  1945944                  N/A          1  AUTOMOTIVE   6750         1320
1  1945945  2016-02-01 00:00:00          1   BABY CARE   1450            0
2  1945946  2016-01-15 00:00:00          1      BEAUTY   1978         6952
3  1945947  2016-01-01 00:00:00          1   BEVERAGES      0            0
4  1945948  2016-01-23 00:00:00          1       BOOKS      0            0

In [22]:
retails.dtypes

id              int64
date           object
store_nbr       int64
family         object
sales           int64
onpromotion     int64
dtype: object

In [27]:
# retails.astype({'date': 'dattime64'}) #it gives an Error

In [32]:
retails.assign(date=pd.to_datetime(retails['date'], errors = 'coerce', infer_datetime_format=True)).info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 449 entries, 0 to 448
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           449 non-null    int64
 1   date         448 non-null    datetime64[ns]
 2   store_nbr    449 non-null    int64
 3   family       449 non-null    object
 4   sales        449 non-null    int64
 5   onpromotion  449 non-null    int64
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 47.4 KB